weather에서 date를 datetime으로 형변환 한다.
year, month, day 필드를 생성한다.
월별, temp의 중앙값, mean_wind의 평균을 구한다.

In [155]:
weather=pd.read_csv('data/weather.csv')
weather

            date  temp  max_wind  mean_wind
0     2010-08-01  28.7       8.3        3.4
1     2010-08-02  25.2       8.7        3.8
2     2010-08-03  22.1       6.3        2.9
3     2010-08-04  25.3       6.6        4.2
4     2010-08-05  27.2       9.1        5.6
...          ...   ...       ...        ...
3648  2020-07-27  22.1       4.2        1.7
3649  2020-07-28  21.9       4.5        1.6
3650  2020-07-29  21.6       3.2        1.0
3651  2020-07-30  22.9       9.7        2.4
3652  2020-07-31  25.7       4.8        2.5

[3653 rows x 4 columns]

In [158]:
weather['date']=pd.to_datetime(weather.date)
weather.info()
weather

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653 entries, 0 to 3652
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       3653 non-null   datetime64[ns]
 1   temp       3653 non-null   float64
 2   max_wind   3649 non-null   float64
 3   mean_wind  3647 non-null   float64
dtypes: datetime64[ns](1), float64(3)
memory usage: 114.3 KB

           date  temp  max_wind  mean_wind
0    2010-08-01  28.7       8.3        3.4
1    2010-08-02  25.2       8.7        3.8
2    2010-08-03  22.1       6.3        2.9
3    2010-08-04  25.3       6.6        4.2
4    2010-08-05  27.2       9.1        5.6
...         ...   ...       ...        ...
3648 2020-07-27  22.1       4.2        1.7
3649 2020-07-28  21.9       4.5        1.6
3650 2020-07-29  21.6       3.2        1.0
3651 2020-07-30  22.9       9.7        2.4
3652 2020-07-31  25.7       4.8        2.5

[3653 rows x 4 columns]

In [160]:
weather['year']=weather['date'].dt.year
weather['month']=weather['date'].dt.month
weather['day']=weather['date'].dt.day
weather

           date  temp  max_wind  mean_wind  year  month  day
0    2010-08-01  28.7       8.3        3.4  2010      8    1
1    2010-08-02  25.2       8.7        3.8  2010      8    2
2    2010-08-03  22.1       6.3        2.9  2010      8    3
3    2010-08-04  25.3       6.6        4.2  2010      8    4
4    2010-08-05  27.2       9.1        5.6  2010      8    5
...         ...   ...       ...        ...   ...    ...  ...
3648 2020-07-27  22.1       4.2        1.7  2020      7   27
3649 2020-07-28  21.9       4.5        1.6  2020      7   28
3650 2020-07-29  21.6       3.2        1.0  2020      7   29
3651 2020-07-30  22.9       9.7        2.4  2020      7   30
3652 2020-07-31  25.7       4.8        2.5  2020      7   31

[3653 rows x 7 columns]

월별, temp의 중앙값, mean_wind의 평균을 구한다.
2개 이상 들어가면 함수 명이 나와.

In [165]:
weather_group=weather.groupby('month').agg({'temp':'median', 'mean_wind':'mean'})
weather_group

        temp  mean_wind
month
1       1.70   3.757419
2       2.30   3.946786
3       6.15   4.390291
4      10.90   4.622483
5      16.60   4.219355
6      19.90   3.461000
7      23.20   3.877419
8      24.85   3.596129
9      20.30   3.661667
10     15.60   3.961613
11     10.45   3.930667
12      3.70   3.817097

In [162]:
weather_group=weather.groupby('month').agg({'temp':['median','count'], 'mean_wind':['mean','count']})
weather_group

        temp       mean_wind
      median count      mean count
month
1       1.70   310  3.757419   310
2       2.30   283  3.946786   280
3       6.15   310  4.390291   309
4      10.90   300  4.622483   298
5      16.60   310  4.219355   310
6      19.90   300  3.461000   300
7      23.20   310  3.877419   310
8      24.85   310  3.596129   310
9      20.30   300  3.661667   300
10     15.60   310  3.961613   310
11     10.45   300  3.930667   300
12      3.70   310  3.817097   310

In [153]:
dust

,name,date,SO2,CO,O3,NO2,PM10,PM25,addr,year,month,day
0,송파구,2021-04-01,0.004,1.0,0.002,0.066,50,18,서울 송파구 백제고분로 236,2021,4,1
1,송파구,2021-04-01,0.004,0.8,0.002,0.058,48,20,서울 송파구 백제고분로 236,2021,4,1
2,송파구,2021-04-01,0.004,0.8,0.002,0.055,44,20,서울 송파구 백제고분로 236,2021,4,1
3,송파구,2021-04-01,0.003,0.8,0.002,0.055,40,20,서울 송파구 백제고분로 236,2021,4,1
4,송파구,2021-04-01,0.004,0.8,0.002,0.053,38,17,서울 송파구 백제고분로 236,2021,4,1
5,송파구,2021-04-01,0.004,0.7,0.002,0.051,38,18,서울 송파구 백제고분로 236,2021,4,1
6,송파구,2021-04-01,0.003,0.7,0.003,0.052,38,17,서울 송파구 백제고분로 236,2021,4,1
7,송파구,2021-04-01,0.004,0.8,0.004,0.057,42,20,서울 송파구 백제고분로 236,2021,4,1
8,송파구,2021-04-01,0.004,0.6,0.014,0.046,45,22,서울 송파구 백제고분로 236,2021,4,1
9,송파구,2021-04-01,0.003,0.4,0.028,0.033,44,16,서울 송파구 백제고분로 236,2021,4,1
10,송파구,2021-04-01,0.003,0.3,0.048,0.014,38,15,서울 송파구 백제고분로 236,2021,4,1
11,송파구,2021-04-01,0.003,0.3,0.053,0.012,39,11,서울 송파구 백제고분로 236,2021,4,1
12,송파구,2021-04-01,0.003,0.3,0.056,0.010,44,13,서울 송파구 백제고분로 236,2021,4,1
13,송파구,2021-04-01,0.003,0.3,0.057,0.011,42,14,서울 송파구 백제고분로 236,2021,4,1
14,송파구,2021-04-01,0.003,0.3,0.057,0.013,44,10,서울 송파구 백제고분로 236,2021,4,1
15,송파구,2021-04-01,0.003,0.3,0.060,0.012,45,11,서울 송파구 백제고분로 236,2021,4,1
16,송파구,2021-04-01,0.003,0.4,0.058,0.015,59,10,서울 송파구 백제고분로 236,2021,4,1
17,송파구,2021-04-01,0.003,0.4,0.052,0.018,68,11,서울 송파구 백제고분로 236,2021,4,1
18,송파구,2021-04-01,0.003,0.4,0.049,0.017,59,10,서울 송파구 백제고분로 236,2021,4,1
19,송파구,2021-04-01,0.003,0.4,0.045,0.019,48,8,서울 송파구 백제고분로 236,2021,4,1
20,송파구,2021-04-01,0.003,0.4,0.047,0.016,44,9,서울 송파구 백제고분로 236,2021,4,1
21,송파구,2021-04-01,0.003,0.4,0.046,0.016,41,9,서울 송파구 백제고분로 236,2021,4,1
22,송파구,2021-04-01,0.003,0.4,0.043,0.017,46,14,서울 송파구 백제고분로 236,2021,4,1
23,송파구,2021-04-01,0.002,0.4,0.047,0.013,46,12,서울 송파구 백제고분로 236,2021,4,1
24,송파구,2021-04-02,0.003,0.3,0.048,0.011,44,15,서울 송파구 백제고분로 236,2021,4,2
25,송파구,2021-04-02,0.003,0.3,0.049,0.010,45,11,서울 송파구 백제고분로 236,2021,4,2
26,송파구,2021-04-02,0.003,0.3,0.051,0.009,47,10,서울 송파구 백제고분로 236,2021,4,2
27,송파구,2021-04-02,0.003,0.3,0.050,0.009,45,11,서울 송파구 백제고분로 236,2021,4,2
28,송파구,2021-04-02,0.002,0.3,0.050,0.010,44,13,서울 송파구 백제고분로 236,2021,4,2
29,송파구,2021-04-02,0.003,0.3,0.044,0.015,42,11,서울 송파구 백제고분로 236,2021,4,2
30,송파구,2021-04-02,0.002,0.4,0.039,0.020,40,9,서울 송파구 백제고분로 236,2021,4,2
31,송파구,2021-04-02,0.003,0.4,0.030,0.031,43,12,서울 송파구 백제고분로 236,2021,4,2

In [152]:
group2=bank_df.groupby('job').agg({'balance':['sum','mean'], 'duration':['mean','count']}) 
group2

               balance                 duration
                   sum         mean        mean count
job
admin.          950041  1139.137890  245.488010   834
blue-collar    1645474  1097.714476  268.138092  1499
entrepreneur    283599  1186.606695  243.970711   239
housemaid       297344  1429.538462  256.341346   208
management     2687701  1722.885256  262.621795  1560
retired         763390  2174.900285  281.413105   351
self-employed   429485  1677.675781  275.160156   256
services        679254  1027.615734  251.605144   661
student         275778  1802.470588  259.849673   153
technician     1491256  1236.530680  270.475124  1206
unemployed      359829  1613.582960  282.179372   223

In [150]:
group2=bank_df.groupby('job')['balance'].agg(['sum','mean','median']) 
group2

                   sum         mean  median
job
admin.          950041  1139.137890   368.0
blue-collar    1645474  1097.714476   387.0
entrepreneur    283599  1186.606695   313.0
housemaid       297344  1429.538462   478.5
management     2687701  1722.885256   604.0
retired         763390  2174.900285   927.0
self-employed   429485  1677.675781   504.5
services        679254  1027.615734   307.0
student         275778  1802.470588   459.0
technician     1491256  1236.530680   419.0
unemployed      359829  1613.582960   687.0

In [ ]:
# group1=bank_df.groupby('job')['balance'].sum() #job별 잔액의 합
group1=bank_df.groupby(['job','y'])['balance'].max() #job별 잔액의 합
group1

job            y
admin.         no     18268
               yes    22086
blue-collar    no     58932
               yes    12519
entrepreneur   no     20527
               yes    11887
housemaid      no     13292
               yes    26965
management     no     38279
               yes    22867
retired        no     32948
               yes    81204
self-employed  no     35368
               yes    10861
services       no     57435
               yes     7066
student        no     16173
               yes    23878
technician     no     31630
               yes    23076
unemployed     no     17418
               yes     7968
Name: balance, dtype: int64

In [ ]:
bank_df=pd.read_csv("data/bank.csv")
bank_df

job
admin.            950041
blue-collar      1645474
entrepreneur      283599
housemaid         297344
management       2687701
retired           763390
self-employed     429485
services          679254
student           275778
technician       1491256
unemployed        359829
Name: balance, dtype: int64

In [141]:
merge_df2=pd.merge(nation, code, how='right', on='국적코드') #left를 기준으로 아웃조인
merge_df2

   국적코드   성별      입국객수      증가수  국적명
0   A01   남성  125000.0   8000.0  필리핀
1   A01   여성  130000.0  10000.0  필리핀
2   A02  NaN       NaN      NaN   일본
3   A03  NaN       NaN      NaN   미국
4   A04  NaN       NaN      NaN   중국
5   A05   남성     300.0     10.0   호주
6   A05   여성     200.0     50.0   호주
7   A06   남성  158912.0  24486.0  베트남
8   A06   여성  325000.0  63466.0  베트남
9   A07  NaN       NaN      NaN  스위스
10  A99  NaN       NaN      NaN   기타

(병합할 코드, on=필드)

In [136]:
merge_df=pd.merge(nation, code, on='국적코드')
merge_df

  국적코드  성별    입국객수    증가수  국적명
0  A01  남성  125000   8000  필리핀
1  A01  여성  130000  10000  필리핀
2  A05  남성     300     10   호주
3  A05  여성     200     50   호주
4  A06  남성  158912  24486  베트남
5  A06  여성  325000  63466  베트남

In [138]:
nation=pd.read_excel('data/nation.xlsx')
code=pd.read_excel('data/code.xlsx')
nation
code

  국적코드  국적명
0  A01  필리핀
1  A02   일본
2  A03   미국
3  A04   중국
4  A05   호주
5  A06  베트남
6  A07  스위스
7  A99   기타

In [134]:
dust['year']=dust['date'].dt.year #dt.year 하면 새로운 필드가 생겨
dust['month']=dust['date'].dt.month
dust['day']=dust['date'].dt.day
dust

,name,date,SO2,CO,O3,NO2,PM10,PM25,addr,year,month,day
0,송파구,2021-04-01,0.004,1.0,0.002,0.066,50,18,서울 송파구 백제고분로 236,2021,4,1
1,송파구,2021-04-01,0.004,0.8,0.002,0.058,48,20,서울 송파구 백제고분로 236,2021,4,1
2,송파구,2021-04-01,0.004,0.8,0.002,0.055,44,20,서울 송파구 백제고분로 236,2021,4,1
3,송파구,2021-04-01,0.003,0.8,0.002,0.055,40,20,서울 송파구 백제고분로 236,2021,4,1
4,송파구,2021-04-01,0.004,0.8,0.002,0.053,38,17,서울 송파구 백제고분로 236,2021,4,1
5,송파구,2021-04-01,0.004,0.7,0.002,0.051,38,18,서울 송파구 백제고분로 236,2021,4,1
6,송파구,2021-04-01,0.003,0.7,0.003,0.052,38,17,서울 송파구 백제고분로 236,2021,4,1
7,송파구,2021-04-01,0.004,0.8,0.004,0.057,42,20,서울 송파구 백제고분로 236,2021,4,1
8,송파구,2021-04-01,0.004,0.6,0.014,0.046,45,22,서울 송파구 백제고분로 236,2021,4,1
9,송파구,2021-04-01,0.003,0.4,0.028,0.033,44,16,서울 송파구 백제고분로 236,2021,4,1
10,송파구,2021-04-01,0.003,0.3,0.048,0.014,38,15,서울 송파구 백제고분로 236,2021,4,1
11,송파구,2021-04-01,0.003,0.3,0.053,0.012,39,11,서울 송파구 백제고분로 236,2021,4,1
12,송파구,2021-04-01,0.003,0.3,0.056,0.010,44,13,서울 송파구 백제고분로 236,2021,4,1
13,송파구,2021-04-01,0.003,0.3,0.057,0.011,42,14,서울 송파구 백제고분로 236,2021,4,1
14,송파구,2021-04-01,0.003,0.3,0.057,0.013,44,10,서울 송파구 백제고분로 236,2021,4,1
15,송파구,2021-04-01,0.003,0.3,0.060,0.012,45,11,서울 송파구 백제고분로 236,2021,4,1
16,송파구,2021-04-01,0.003,0.4,0.058,0.015,59,10,서울 송파구 백제고분로 236,2021,4,1
17,송파구,2021-04-01,0.003,0.4,0.052,0.018,68,11,서울 송파구 백제고분로 236,2021,4,1
18,송파구,2021-04-01,0.003,0.4,0.049,0.017,59,10,서울 송파구 백제고분로 236,2021,4,1
19,송파구,2021-04-01,0.003,0.4,0.045,0.019,48,8,서울 송파구 백제고분로 236,2021,4,1
20,송파구,2021-04-01,0.003,0.4,0.047,0.016,44,9,서울 송파구 백제고분로 236,2021,4,1
21,송파구,2021-04-01,0.003,0.4,0.046,0.016,41,9,서울 송파구 백제고분로 236,2021,4,1
22,송파구,2021-04-01,0.003,0.4,0.043,0.017,46,14,서울 송파구 백제고분로 236,2021,4,1
23,송파구,2021-04-01,0.002,0.4,0.047,0.013,46,12,서울 송파구 백제고분로 236,2021,4,1
24,송파구,2021-04-02,0.003,0.3,0.048,0.011,44,15,서울 송파구 백제고분로 236,2021,4,2
25,송파구,2021-04-02,0.003,0.3,0.049,0.010,45,11,서울 송파구 백제고분로 236,2021,4,2
26,송파구,2021-04-02,0.003,0.3,0.051,0.009,47,10,서울 송파구 백제고분로 236,2021,4,2
27,송파구,2021-04-02,0.003,0.3,0.050,0.009,45,11,서울 송파구 백제고분로 236,2021,4,2
28,송파구,2021-04-02,0.002,0.3,0.050,0.010,44,13,서울 송파구 백제고분로 236,2021,4,2
29,송파구,2021-04-02,0.003,0.3,0.044,0.015,42,11,서울 송파구 백제고분로 236,2021,4,2
30,송파구,2021-04-02,0.002,0.4,0.039,0.020,40,9,서울 송파구 백제고분로 236,2021,4,2
31,송파구,2021-04-02,0.003,0.4,0.030,0.031,43,12,서울 송파구 백제고분로 236,2021,4,2

In [132]:
# dust['date']=dust['date'].str.slice(0,8) # 8까지 잘라
dust['date']=pd.to_datetime(dust.date)
dust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    32 non-null     object
 1   date    32 non-null     datetime64[ns]
 2   SO2     32 non-null     float64
 3   CO      32 non-null     float64
 4   O3      32 non-null     float64
 5   NO2     32 non-null     float64
 6   PM10    32 non-null     int64
 7   PM25    32 non-null     int64
 8   addr    32 non-null     object
dtypes: datetime64[ns](1), float64(4), int64(2), object(2)
memory usage: 2.4+ KB

In [127]:
dust

   name        date    SO2   CO     O3    NO2  PM10  PM25              addr
0   송파구  2021040101  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236
1   송파구  2021040102  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236
2   송파구  2021040103  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236
3   송파구  2021040104  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236
4   송파구  2021040105  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236
5   송파구  2021040106  0.004  0.7  0.002  0.051    38    18  서울 송파구 백제고분로 236
6   송파구  2021040107  0.003  0.7  0.003  0.052    38    17  서울 송파구 백제고분로 236
7   송파구  2021040108  0.004  0.8  0.004  0.057    42    20  서울 송파구 백제고분로 236
8   송파구  2021040109  0.004  0.6  0.014  0.046    45    22  서울 송파구 백제고분로 236
9   송파구  2021040110  0.003  0.4  0.028  0.033    44    16  서울 송파구 백제고분로 236
10  송파구  2021040111  0.003  0.3  0.048  0.014    38    15  서울 송파구 백제고분로 236
11  송파구  2021040112  0.003  0.3  0.053  0.012    39    11  서울 송파구 백제고분로 236
12  송파구  2021040113  0.003  0.3  0.056  0.010    44    13  서울 송파구 백제고분로 236
13  송파구  2021040114  0.003  0.3  0.057  0.011    42    14  서울 송파구 백제고분로 236
14  송파구  2021040115  0.003  0.3  0.057  0.013    44    10  서울 송파구 백제고분로 236
15  송파구  2021040116  0.003  0.3  0.060  0.012    45    11  서울 송파구 백제고분로 236
16  송파구  2021040117  0.003  0.4  0.058  0.015    59    10  서울 송파구 백제고분로 236
17  송파구  2021040118  0.003  0.4  0.052  0.018    68    11  서울 송파구 백제고분로 236
18  송파구  2021040119  0.003  0.4  0.049  0.017    59    10  서울 송파구 백제고분로 236
19  송파구  2021040120  0.003  0.4  0.045  0.019    48     8  서울 송파구 백제고분로 236
20  송파구  2021040121  0.003  0.4  0.047  0.016    44     9  서울 송파구 백제고분로 236
21  송파구  2021040122  0.003  0.4  0.046  0.016    41     9  서울 송파구 백제고분로 236
22  송파구  2021040123  0.003  0.4  0.043  0.017    46    14  서울 송파구 백제고분로 236
23  송파구  2021040124  0.002  0.4  0.047  0.013    46    12  서울 송파구 백제고분로 236
24  송파구  2021040201  0.003  0.3  0.048  0.011    44    15  서울 송파구 백제고분로 236
25  송파구  2021040202  0.003  0.3  0.049  0.010    45    11  서울 송파구 백제고분로 236
26  송파구  2021040203  0.003  0.3  0.051  0.009    47    10  서울 송파구 백제고분로 236
27  송파구  2021040204  0.003  0.3  0.050  0.009    45    11  서울 송파구 백제고분로 236
28  송파구  2021040205  0.002  0.3  0.050  0.010    44    13  서울 송파구 백제고분로 236
29  송파구  2021040206  0.003  0.3  0.044  0.015    42    11  서울 송파구 백제고분로 236
30  송파구  2021040207  0.002  0.4  0.039  0.020    40     9  서울 송파구 백제고분로 236
31  송파구  2021040208  0.003  0.4  0.030  0.031    43    12  서울 송파구 백제고분로 236

In [126]:
dust['date'] = dust['date'].astype(str)
dust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    32 non-null     object
 1   date    32 non-null     object
 2   SO2     32 non-null     float64
 3   CO      32 non-null     float64
 4   O3      32 non-null     float64
 5   NO2     32 non-null     float64
 6   PM10    32 non-null     int64
 7   PM25    32 non-null     int64
 8   addr    32 non-null     object
dtypes: float64(4), int64(2), object(3)
memory usage: 2.4+ KB

In [125]:
dust['date'].dtype

dtype('int64')

In [123]:
dust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32 entries, 0 to 31
Data columns (total 9 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    32 non-null     object
 1   date    32 non-null     int64
 2   SO2     32 non-null     float64
 3   CO      32 non-null     float64
 4   O3      32 non-null     float64
 5   NO2     32 non-null     float64
 6   PM10    32 non-null     int64
 7   PM25    32 non-null     int64
 8   addr    32 non-null     object
dtypes: float64(4), int64(3), object(2)
memory usage: 2.4+ KB

In [122]:
dust.rename(columns={'측정소명':'name'},inplace=True)
dust.columns
dust.head()

  name        date    SO2   CO     O3    NO2  PM10  PM25              addr
0  송파구  2021040101  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236
1  송파구  2021040102  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236
2  송파구  2021040103  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236
3  송파구  2021040104  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236
4  송파구  2021040105  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236

In [118]:
dust=dust.drop(['지역', '망', '측정소코드'], axis=1)
dust.head()

  측정소명        측정일시    SO2   CO     O3    NO2  PM10  PM25                주소
0  송파구  2021040101  0.004  1.0  0.002  0.066    50    18  서울 송파구 백제고분로 236
1  송파구  2021040102  0.004  0.8  0.002  0.058    48    20  서울 송파구 백제고분로 236
2  송파구  2021040103  0.004  0.8  0.002  0.055    44    20  서울 송파구 백제고분로 236
3  송파구  2021040104  0.003  0.8  0.002  0.055    40    20  서울 송파구 백제고분로 236
4  송파구  2021040105  0.004  0.8  0.002  0.053    38    17  서울 송파구 백제고분로 236

In [117]:
dust=pd.read_excel("data/dust1.xlsx")
dust

,지역,망,측정소코드,측정소명,측정일시,SO2,CO,O3,NO2,PM10,PM25,주소
0,서울 송파구,도시대기,111273,송파구,2021040101,0.004,1.0,0.002,0.066,50,18,서울 송파구 백제고분로 236
1,서울 송파구,도시대기,111273,송파구,2021040102,0.004,0.8,0.002,0.058,48,20,서울 송파구 백제고분로 236
2,서울 송파구,도시대기,111273,송파구,2021040103,0.004,0.8,0.002,0.055,44,20,서울 송파구 백제고분로 236
3,서울 송파구,도시대기,111273,송파구,2021040104,0.003,0.8,0.002,0.055,40,20,서울 송파구 백제고분로 236
4,서울 송파구,도시대기,111273,송파구,2021040105,0.004,0.8,0.002,0.053,38,17,서울 송파구 백제고분로 236
5,서울 송파구,도시대기,111273,송파구,2021040106,0.004,0.7,0.002,0.051,38,18,서울 송파구 백제고분로 236
6,서울 송파구,도시대기,111273,송파구,2021040107,0.003,0.7,0.003,0.052,38,17,서울 송파구 백제고분로 236
7,서울 송파구,도시대기,111273,송파구,2021040108,0.004,0.8,0.004,0.057,42,20,서울 송파구 백제고분로 236
8,서울 송파구,도시대기,111273,송파구,2021040109,0.004,0.6,0.014,0.046,45,22,서울 송파구 백제고분로 236
9,서울 송파구,도시대기,111273,송파구,2021040110,0.003,0.4,0.028,0.033,44,16,서울 송파구 백제고분로 236
10,서울 송파구,도시대기,111273,송파구,2021040111,0.003,0.3,0.048,0.014,38,15,서울 송파구 백제고분로 236
11,서울 송파구,도시대기,111273,송파구,2021040112,0.003,0.3,0.053,0.012,39,11,서울 송파구 백제고분로 236
12,서울 송파구,도시대기,111273,송파구,2021040113,0.003,0.3,0.056,0.010,44,13,서울 송파구 백제고분로 236
13,서울 송파구,도시대기,111273,송파구,2021040114,0.003,0.3,0.057,0.011,42,14,서울 송파구 백제고분로 236
14,서울 송파구,도시대기,111273,송파구,2021040115,0.003,0.3,0.057,0.013,44,10,서울 송파구 백제고분로 236
15,서울 송파구,도시대기,111273,송파구,2021040116,0.003,0.3,0.060,0.012,45,11,서울 송파구 백제고분로 236
16,서울 송파구,도시대기,111273,송파구,2021040117,0.003,0.4,0.058,0.015,59,10,서울 송파구 백제고분로 236
17,서울 송파구,도시대기,111273,송파구,2021040118,0.003,0.4,0.052,0.018,68,11,서울 송파구 백제고분로 236
18,서울 송파구,도시대기,111273,송파구,2021040119,0.003,0.4,0.049,0.017,59,10,서울 송파구 백제고분로 236
19,서울 송파구,도시대기,111273,송파구,2021040120,0.003,0.4,0.045,0.019,48,8,서울 송파구 백제고분로 236
20,서울 송파구,도시대기,111273,송파구,2021040121,0.003,0.4,0.047,0.016,44,9,서울 송파구 백제고분로 236
21,서울 송파구,도시대기,111273,송파구,2021040122,0.003,0.4,0.046,0.016,41,9,서울 송파구 백제고분로 236
22,서울 송파구,도시대기,111273,송파구,2021040123,0.003,0.4,0.043,0.017,46,14,서울 송파구 백제고분로 236
23,서울 송파구,도시대기,111273,송파구,2021040124,0.002,0.4,0.047,0.013,46,12,서울 송파구 백제고분로 236
24,서울 송파구,도시대기,111273,송파구,2021040201,0.003,0.3,0.048,0.011,44,15,서울 송파구 백제고분로 236
25,서울 송파구,도시대기,111273,송파구,2021040202,0.003,0.3,0.049,0.010,45,11,서울 송파구 백제고분로 236
26,서울 송파구,도시대기,111273,송파구,2021040203,0.003,0.3,0.051,0.009,47,10,서울 송파구 백제고분로 236
27,서울 송파구,도시대기,111273,송파구,2021040204,0.003,0.3,0.050,0.009,45,11,서울 송파구 백제고분로 236
28,서울 송파구,도시대기,111273,송파구,2021040205,0.002,0.3,0.050,0.010,44,13,서울 송파구 백제고분로 236
29,서울 송파구,도시대기,111273,송파구,2021040206,0.003,0.3,0.044,0.015,42,11,서울 송파구 백제고분로 236
30,서울 송파구,도시대기,111273,송파구,2021040207,0.002,0.4,0.039,0.020,40,9,서울 송파구 백제고분로 236
31,서울 송파구,도시대기,111273,송파구,2021040208,0.003,0.4,0.030,0.031,43,12,서울 송파구 백제고분로 236

결측치 제거

In [ ]:
df4=df.fillna(df.mean()) #평균값으로 채워
df4.isnull().sum()

In [ ]:
df.isnull().sum()

temp         0
max_wind     0
mean_wind    0
dtype: int64

In [ ]:
df.info()
df.isnull().sum()
df2=df.dropna() #결측치 지워서 3646
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3646 entries, 2010-08-01 to 2020-07-31
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   temp       3646 non-null   float64
 1   max_wind   3646 non-null   float64
 2   mean_wind  3646 non-null   float64
dtypes: float64(3)
memory usage: 113.9+ KB
<class 'pandas.core.frame.DataFrame'>
Index: 3646 entries, 2010-08-01 to 2020-07-31
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   temp       3646 non-null   float64
 1   max_wind   3646 non-null   float64
 2   mean_wind  3646 non-null   float64
dtypes: float64(3)
memory usage: 113.9+ KB

In [111]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3646 entries, 2010-08-01 to 2020-07-31
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   temp       3646 non-null   float64
 1   max_wind   3646 non-null   float64
 2   mean_wind  3646 non-null   float64
dtypes: float64(3)
memory usage: 113.9+ KB

In [110]:
df.isnull().sum()

temp         0
max_wind     0
mean_wind    0
dtype: int64

In [97]:
df[df['max_wind'].isna()]

            temp  max_wind  mean_wind
date
2012-02-11  -0.7       NaN        NaN
2012-02-12   0.4       NaN        NaN
2012-02-13   4.0       NaN        NaN
2019-04-19   7.8       NaN        2.3

결측치 확인하기. 결측치는 nan으로 나와

In [95]:
np.sum(df.isna())

c:\Users\it\anaconda3\Lib\site-packages\numpy\_core\fromnumeric.py:84: FutureWarning: The behavior of DataFrame.sum with axis=None is deprecated, in a future version this will reduce over both axes and return a scalar. To retain the old behavior, pass axis=0 (or do not pass axis)
  return reduction(axis=axis, out=out, **passkwargs)

temp         0
max_wind     4
mean_wind    6
dtype: int64

bank에서 balance가 2000 이상인 사람을 표시하라.

In [94]:
df7.loc[((df7.balance>10000) & (df7.duration>=300)),['job','balance','duration']]

                job  balance  duration
358      technician    24299       704
798     blue-collar    29050       563
1046     technician    10865       350
1089        student    16173       489
1661      housemaid    13292      1238
1789       services    20541       501
2025    blue-collar    58932       339
3067     management    13021       425
3123     management    10273       359
3140     management    15904       504
3282     technician    23919       384
3935  self-employed    10653       336
3971   entrepreneur    11887      1181
4186       services    11512       301
4274     management    19391       391
4279    blue-collar    12519       615
4353       services    57435       319
4360     management    22520       579
4855     management    14344       358
5058    blue-collar    13408       647
5177    blue-collar    13654       528
5182    blue-collar    10045       617
5403     management    10281       400
5850     management    23552       507
6194     technician    13460      1068
6493        student    10086       475
6546      housemaid    11219       699
6793     management    11891       821
6849        retired    23421       432
6926        retired    81204       390
6944      housemaid    26965       654
7070  self-employed    10861       336

In [84]:
df.loc[df.temp>=30,:] # 행은 조건을 주고 열을 전체
df.loc[df.mean_wind>=12,:]

            temp  max_wind  mean_wind
date
2011-04-19   4.4      21.6       12.1
2011-09-03  21.0      16.1       12.5
2015-08-25  20.1      25.3       14.9
2016-08-29  17.7      17.7       13.3
2017-10-22  14.5      15.7       12.7
2018-03-20   1.2      15.5       12.0
2019-10-12  15.7      16.4       12.7

In [76]:
#df.set_index('date', inplace=True) #데이트가 인덱스가 됨
df.loc['2010-08-01':'2010-08-10',:] # : 모든데이터

            temp  max_wind  mean_wind
date
2010-08-01  28.7       8.3        3.4
2010-08-02  25.2       8.7        3.8
2010-08-03  22.1       6.3        2.9
2010-08-04  25.3       6.6        4.2
2010-08-05  27.2       9.1        5.6
2010-08-06  26.8       9.8        8.0
2010-08-07  27.5       9.1        5.0
2010-08-08  26.6       5.9        4.0
2010-08-09  26.9       5.1        3.1
2010-08-10  25.6      10.2        5.5

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3653 entries, 0 to 3652
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       3653 non-null   object
 1   temp       3653 non-null   float64
 2   max_wind   3649 non-null   float64
 3   mean_wind  3647 non-null   float64
dtypes: float64(3), object(1)
memory usage: 114.3+ KB

In [72]:
df=pd.read_csv("data/weather.csv")
df

            date  temp  max_wind  mean_wind
0     2010-08-01  28.7       8.3        3.4
1     2010-08-02  25.2       8.7        3.8
2     2010-08-03  22.1       6.3        2.9
3     2010-08-04  25.3       6.6        4.2
4     2010-08-05  27.2       9.1        5.6
...          ...   ...       ...        ...
3648  2020-07-27  22.1       4.2        1.7
3649  2020-07-28  21.9       4.5        1.6
3650  2020-07-29  21.6       3.2        1.0
3651  2020-07-30  22.9       9.7        2.4
3652  2020-07-31  25.7       4.8        2.5

[3653 rows x 4 columns]

In [71]:
df7.iloc[[0,3,5],[0,2]] # 위치정보로 가지고 올수있어

          job  balance
0  management     2143
3  technician       -3
5     retired      100

In [68]:
df7.loc[:5:2,['job','balance']] # 오른쪽은 행, 왼쪽은 열

           job  balance
0   management     2143
2  blue-collar       -7
4   technician     -103

In [63]:
data=df7[['job', 'balance']]
print(type(data))

<class 'pandas.core.frame.DataFrame'>

In [62]:
job=df7.job
print(type(job))

<class 'pandas.core.series.Series'>

In [61]:
df7['balance'].dtype

dtype('int64')

In [60]:
df7.dtypes

job          object
education    object
balance       int64
duration      int64
y            object
dtype: object

In [59]:
df7.shape

(7234, 5)

In [56]:
df7.job.unique()

array(['management', 'technician', 'blue-collar', 'retired', 'services',
       'admin.', 'entrepreneur', 'self-employed', 'unemployed', 'student',
       nan, 'housemaid'], dtype=object)

In [53]:
df7['job'].value_counts(ascending=True)

job
student           153
housemaid         208
unemployed        223
entrepreneur      239
self-employed     256
retired           351
services          661
admin.            834
technician       1206
blue-collar      1499
management       1560
Name: count, dtype: int64

In [52]:
df7.sort_index(inplace=True)
df7

                job  education  balance  duration    y
0        management   tertiary     2143       261   no
1        technician  secondary      265       348   no
2       blue-collar  secondary       -7       365   no
3        technician  secondary       -3      1666   no
4        technician  secondary     -103       145   no
...             ...        ...      ...       ...  ...
7229       services  secondary      199       173   no
7230  self-employed   tertiary      159       449  yes
7231     management   tertiary      138       162   no
7232     management   tertiary     1428       333   no
7233     technician  secondary      505       386  yes

[7234 rows x 5 columns]

In [51]:
df7.sort_values(by='balance', ascending=False, inplace=True) 
#false는 역순 / 정방향 / inplace=True 연산저장
df7

                job  education  balance  duration    y
6926        retired  secondary    81204       390  yes
2025    blue-collar  secondary    58932       339   no
4353       services  secondary    57435       319   no
2361     management   tertiary    38279       225   no
6692     management   tertiary    37378       146   no
...             ...        ...      ...       ...  ...
1937     technician  secondary    -1680        92   no
3981   entrepreneur  secondary    -1882        17   no
2506     management   tertiary    -1884       193   no
2289     management   tertiary    -2282       301   no
298   self-employed   tertiary    -3313       153   no

[7234 rows x 5 columns]

In [ ]:
print(df7['balance'].mean()) #평균
print(df7['balance'].max())
print(df7['balance'].min())
print(df7['balance'].sum())
print(df7['balance'].median()) #중앙값

1374.9129112524192
81204
-3313
9946120
453.5

In [42]:
df7.describe()

            balance     duration
count   7234.000000  7234.000000
mean    1374.912911   262.875311
std     3033.882933   268.921065
min    -3313.000000     0.000000
25%       74.000000   103.000000
50%      453.500000   183.000000
75%     1470.750000   321.750000
max    81204.000000  3366.000000

In [41]:
df7.index
df7.columns

Index(['job', 'education', 'balance', 'duration', 'y'], dtype='object')

In [37]:
df7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7234 entries, 0 to 7233
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   job        7190 non-null   object
 1   education  6961 non-null   object
 2   balance    7234 non-null   int64
 3   duration   7234 non-null   int64
 4   y          7234 non-null   object
dtypes: int64(2), object(3)
memory usage: 282.7+ KB

In [36]:
df7=pd.read_csv('data/bank.csv')
df7

                job  education  balance  duration    y
0        management   tertiary     2143       261   no
1        technician  secondary      265       348   no
2       blue-collar  secondary       -7       365   no
3        technician  secondary       -3      1666   no
4        technician  secondary     -103       145   no
...             ...        ...      ...       ...  ...
7229       services  secondary      199       173   no
7230  self-employed   tertiary      159       449  yes
7231     management   tertiary      138       162   no
7232     management   tertiary     1428       333   no
7233     technician  secondary      505       386  yes

[7234 rows x 5 columns]

In [32]:
df6=pd.read_excel("data/score.xlsx")
df6

   권순영  85    무용
0  전원우  90    컴공
1  윤정한  90  방송광고
2  최승철  90  사회체육

In [31]:
df5=pd.read_csv("data/score.csv", header=None)
df5.columns=['name', 'score', 'major']
df5

  name  score major
0  권순영     85    무용
1  전원우     90    컴공
2  윤정한     90  방송광고
3  최승철     90  사회체육

In [ ]:
df4=pd.read_excel("data/code.xlsx")
df4

  국적코드  국적명
0  A01  필리핀
1  A02   일본
2  A03   미국
3  A04   중국
4  A05   호주
5  A06  베트남
6  A07  스위스
7  A99   기타

In [11]:
df3=pd.read_csv("data/mobile.csv")
df3

     Brand   Color  price
0  Samsung   Black    100
1       LG    Gold     70
2    Apple  Silver    150
3    Apple    Gray    120

In [ ]:
df2=pd.DataFrame(data).T
df2.columns=['name', 'score', 'depts']
df2

  name score depts
0  권순영    90    무용
1  전원우    85    컴공
2  윤정한    90    경영
3  최승철    90  사회체육

In [ ]:
df2.to_csv("data/student.csv") #인덱스가 생긴 상태

In [24]:
df2_1=pd.read_csv('data/student.csv', index_col=0)
df2_2=pd.read_csv('data/student.csv')
df2_1

  name  score depts
0  권순영     90    무용
1  전원우     85    컴공
2  윤정한     90    경영
3  최승철     90  사회체육

In [ ]:
data=[name, score, depts]
data # 1차원으로 나오니 행과 열의 전치가 필요

[['권순영', '전원우', '윤정한', '최승철'], [90, 85, 90, 90], ['무용', '컴공', '경영', '사회체육']]

In [7]:
name=['권순영', '전원우', '윤정한','최승철']
score=[90,85,90,90]
depts=['무용','컴공','경영','사회체육']
df1=pd.DataFrame({'name':name, 'score':score, 'depts':depts})
df1

  name  score depts
0  권순영     90    무용
1  전원우     85    컴공
2  윤정한     90    경영
3  최승철     90  사회체육

In [5]:
arr=np.arange(12).reshape(4,3) #0-11까지 배열 -> 2차원으로
df=pd.DataFrame(arr, columns=['A', 'B', 'C'])
df

   A   B   C
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [2]:
s2=pd.Series(list, index=['a', 'b', 'c', 'd', 'e'])
print(s2)
print(s2.index)
print(s2.values)

a    1
b    2
c    3
d    4
e    5
dtype: int64
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
[1 2 3 4 5]

In [3]:
import numpy as np
import pandas as pd
list = [1,2,3,4,5]
s=pd.Series(list)
print(s)
print(s.index)
print(s.values)

0    1
1    2
2    3
3    4
4    5
dtype: int64
RangeIndex(start=0, stop=5, step=1)
[1 2 3 4 5]